
[
    {
        "id": 0,
        "title": "Portfolio website",
        "img_url": "../../src/assets/Project cover.png",
        "tech_stack":[
            {"name": "react", "logo_url": "../../src/assets/react.svg"},
            {"name": "tailwind", "logo_url": "../../src/assets/tailwind.svg"},
            {"name": "json", "logo_url": "../../src/assets/json.svg"}
        ],
        "about": "This portfolio website is a personal project that showcases my skills and experience as a front-end developer.It's built using React, a popular JavaScript library for building user interfaces, and Tailwind CSS, a utility-first CSS framework that provides a flexible and efficient way to style web pages. I chose this project as my first foray into React development to gain practical experience with these technologies and create a platform to highlight my work.",

        "process": "Planning:\n * Defined project goals and target audience.\n* Mapped out user flow and key features.\n* Researched React and Tailwind documentation and tutorials.\n* Created wireframes and mockups for visual design.\n\nDevelopment:\n* Set up React development environment and project structure.\n* Implemented components for homepage, project showcase, and detail pages.\n* Integrated React Router for navigation and routing.\n* Styled components using Tailwind CSS classes and custom styling.\n* Fetched and displayed project data from a JSON file.\n* Added responsiveness for different screen sizes.\n\nTesting and Refinement:\n* Thoroughly tested functionality and user experience across browsers.\n* Addressed any bugs or issues discovered during testing.\n* Made adjustments to design and content based on feedback.",

        "challenges": "Learning Curve:\n* As my first React project, I faced challenges in understanding React concepts like components, state management, and routing.\n* Tailwind's utility-first approach required a shift in thinking about CSS.\n\nData Fetching:\n* Integrating data fetching from a JSON file involved learning about asynchronous operations and handling API responses.\n\nOvercoming Challenges:\n* Persistence and problem-solving skills were essential.\n* Utilized online resources, tutorials, and community forums for guidance.\n* Embraced trial and error as part of the learning process.",
        
        "livedemo": "#",
        "coderepository": "#"
    }
]
