
[
    {
        "id": 0,
        "title": "Portfolio website",
        "img_url": "/images/Project cover.png",
        "tech_stack":[
            {"name": "React", "logo_url": "/images/react.svg"},
            {"name": "Tailwind CSS", "logo_url": "/images/tailwind.svg"},
            {"name": "json", "logo_url": "/images/json.svg"}
        ],
        "about": "This portfolio website is a personal project that showcases my skills and experience as a front-end developer.It's built using React, a popular JavaScript library for building user interfaces, and Tailwind CSS, a utility-first CSS framework that provides a flexible and efficient way to style web pages. I chose this project as my first foray into React development to gain practical experience with these technologies and create a platform to highlight my work.",

        "process": "Planning: <br /> * Defined project goals and target audience. <br />* Mapped out user flow and key features. <br />* Researched React and Tailwind documentation and tutorials. <br />* Created wireframes and mockups for visual design. <br /> <br />Development: <br />* Set up React development environment and project structure. <br />* Implemented components for homepage, project showcase, and detail pages. <br />* Integrated React Router for navigation and routing. <br />* Styled components using Tailwind CSS classes and custom styling. <br />* Fetched and displayed project data from a JSON file. <br />* Added responsiveness for different screen sizes. <br /> <br />Testing and Refinement: <br />* Thoroughly tested functionality and user experience across browsers. <br />* Addressed any bugs or issues discovered during testing. <br />* Made adjustments to design and content based on feedback.",

        "challenges": "Learning Curve: <br />* As my first React project, I faced challenges in understanding React concepts like components, state management, and routing. <br />* Tailwind's utility-first approach required a shift in thinking about CSS. <br /> <br />Data Fetching: <br />* Integrating data fetching from a JSON file involved learning about asynchronous operations and handling API responses. <br /> <br />Overcoming Challenges: <br />* Persistence and problem-solving skills were essential. <br />* Utilized online resources, tutorials, and community forums for guidance. <br />* Embraced trial and error as part of the learning process.",
        
        "livedemo": "https://solankibhautik.netlify.app/",
        "coderepository": "https://github.com/SolankiBhautik/Portfolio-website"
    },
    {
      "id": 1,
      "title": "HooBank",
      "img_url": "/images/hoobank.png",
      "tech_stack": [
        {
          "name": "React",
          "logo_url": "/images/react.svg"
        },
        {
          "name": "Tailwind CSS",
          "logo_url": "/images/tailwind.svg"
        }
      ],
      "abouttheproject": "A single-page frontend mockup of a banking website for the fictional company HooBank. Built with React and Tailwind CSS.",
      "process": "This project was built using React and Tailwind CSS. The primary goal of this project was to create a single-page frontend mockup of a banking website for the fictional company HooBank. The project was developed using a component-based architecture, with React Router for navigation and routing. Tailwind CSS was used for styling, with custom CSS for additional styling. The project was designed in Figma, with the design files integrated into the development workflow.",
      "challenges": "The primary challenge of this project was learning how to use React and Tailwind CSS together. The utility-first approach of Tailwind CSS required a shift in thinking about CSS, while React's component-based architecture required a different approach to structuring the code. Additionally, integrating the Figma design files into the development workflow was a new experience.",
      "livedemo": "https://hoobanknot.netlify.app/",
      "coderepository": "https://github.com/SolankiBhautik/HooBank-website"
    }
]
